# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
tap 'universal-ctags/universal-ctags'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'vim'
brew 'grip'
brew 'httpie'
brew 'openvpn-connect'
brew 'tldr'
brew 'tree'
brew 'wget'
brew 'osx-cup-temp'
brew 'glances'
brew '--with-jansson --HEAD universal-ctags/universal-ctags/universal-ctags'

# Development
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'heroku'

# Font
cask 'font-fira-code'

# App
cask 'google-chrome'
cask 'dropbox'
cask 'slack'
cask 'spotify'
cask 'notion'
cask 'evernote'
cask 'visual-studio-code'
cask 'zoomus'
cask 'typora'
cask 'postman'
cask 'postgresql'
cask 'studio-3t'
cask 'postico'
cask 'docker'
cask 'beekeeper-studio'
cask 'ngrok'
